xtee55/mediator-common-test/src/main/resources/xroad-simple2.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xrd="http://x-rd.net/xsd/xroad.xsd"
        xmlns:foobar="http://example.com/xsd/foobar.xsd">
    <SOAP-ENV:Header>
        <xrd:consumer>consumer</xrd:consumer>
        <xrd:producer>producer</xrd:producer>
        <xrd:userId>EE37702211234</xrd:userId>
        <xrd:service>producer.testQuery.v1</xrd:service>
        <xrd:id>1234567890</xrd:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <foobar:testQuery>
            <request>
                <name>foo</name>
                <age>35</age>
            </request>
        </foobar:testQuery>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
